# Get Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Entity..::..Get Method
Entity Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Get<(Of <<'(FieldType>)>>)(String) | Retrieves the value of the field in the entity. |
| Get<(Of <<'(FieldType>)>>)(Field) | Retrieves the value of the field in the entity. |
| Get<(Of <<'(FieldType>)>>)(String, ForgeTypeId) | Retrieves the value of the field in the entity. |
| Get<(Of <<'(FieldType>)>>)(Field, ForgeTypeId) | Retrieves the value of the field in the entity. |

# See Also
Entity Class
Entity Members
Autodesk.Revit.DB.ExtensibleStorage Namespace